

n = 1#Счётчик
x = float(input("Введите x = "))
t = 1#член суммы ряда
y = t#Сумма
e = float(input("Точность = "))
maxi = int(input("Максимальное количество итераций = "))
step = int(input("Шаг печати = "))

#табличка!
print("-----------------------------------")
print("|  №  |      t      |      y      |")
print("|---------------------------------|")
print(f"| {n}" + (4 - len(str(n))) * " " + f"| {t:g}" + (12 - len(f"{t:g}")) * " " + f"| {y:g}" +
              (12 - len(f"{y:g}")) * " " + "|")

while abs(t) > e and n < maxi:    #пока член ряда больше заданной точности и счётчик меньше максимальной итерации
    n += 1
    #t = (-1)**n * 1 / ((2 * n + 1 ) * x **  (2 * n + 1)) 
    t = ((x)**n)/n
    #t = t * x * (n-1)/n
    y += t
    if (n - 1) % step == 0:   #вывод элементов, соответствующих шагу
        print(f"| {n}" + (4 - len(str(n))) * " " + f"| {t:g}" + (12 - len(f"{t:g}")) * " " + f"| {y:g}" +
              (12 - len(f"{y:g}")) * " " + "|")    #табличка

print("-----------------------------------")

if abs(t) <= e:      #проверка
    print(f"Сумма бесконечного ряда - {y:g}, вычислена за {n} итераций")
else:
    print("За указанное число итераций необходимой точности достичь не удалось")